const QSData = {
    questions: [
        {
            "question": "用微波炉加热的水，放入一小勺速溶咖啡，会出现什么现象？",
            "answer": [
                "A 速溶咖啡漂浮在水面",
                "B 速溶咖啡粉末飞溅",
                "C 迅速溶解喷发"
            ],
            "right": "C",
            "rightIdx": 3,
            "id": 1
        },
        {
            "question": "闭上眼睛、捏住鼻子后，你能否分辨出牛奶、乳酸菌和咖啡的区别？",
            "answer": [
                "A 能",
                "B 不能"
            ],
            "right": "A",
            "rightIdx": 1,
            "id": 2
        },
        {
            "question": "什么要先用开水烫？",
            "answer": [
                "A 可以保护白菜里的营养成分",
                "B 能够有效去除农药等化学残留物",
                "C 开水烫过的白菜水分去除，在烹饪过程中不容易导致油花飞溅"
            ],
            "right": "A",
            "rightIdx": 1,
            "id": 3
        },
        {
            "question": "装有哪种材料的气球，被火烧后会安然无恙？",
            "answer": [
                "A 冰块",
                "B 热水",
                "C 碳酸饮料",
                "D 巧克力"
            ],
            "right": "B",
            "rightIdx": 2,
            "id": 4
        },
        {
            "question": "以下哪种方法在用吸管喝热饮的时候将热饮降温，效果最好？",
            "answer": [
                "A 不将吸管插到到杯底 并用手捏住吸管一头",
                "B 用两根吸管同时喝",
                "C 将吸管纵向对折成四等份后"
            ],
            "right": "B",
            "rightIdx": 2,
            "id": 5
        },
        {
            "question": "用火加热纸锅能做熟以下哪种食物？",
            "answer": [
                "A 不能做熟鸡蛋 能做熟面条",
                "B 能做熟鸡蛋 不能做熟面条",
                "C 鸡蛋和面条都可以做熟"
            ],
            "right": "C",
            "rightIdx": 3,
            "id": 6
        },
        {
            "question": "以下哪种方式可以让人暂时丧失味觉？",
            "answer": [
                "A:用冰块敷舌头之后",
                "B:用电吹风吹舌头之后",
                "C:含热牛奶之后",
                "D:用过漱口水之后"
            ],
            "right": "B",
            "rightIdx": 2,
            "id": 7
        },
        {
            "question": "以下哪种方法切洋葱，眼睛不会因味道刺激而流泪？",
            "answer": [
                "A:叼着面包片切",
                "B:切之前在热水里泡十分钟",
                "C:四周点燃蜡烛切",
                "D:将洋葱冷藏半小时再切"
            ],
            "right": "D",
            "rightIdx": 4,
            "id": 8
        },
        {
            "question": "对于鸡蛋清的生活妙用，以下哪种说法是错误的？",
            "answer": [
                "A. 鸡蛋清可以清除粘在衣服上的口香糖",
                "B. 鸡蛋清可以修补破裂的器皿",
                "C. 鸡蛋清可以清洁杯子里的茶垢"
            ],
            "right": "C",
            "rightIdx": 3,
            "id": 9
        },
        {
            "question": "以下哪种物质可吸水量最大？",
            "answer": [
                "A:3块尿不湿",
                "B:5块海绵",
                "C:10条毛巾",
                "D:20张厨房用纸"
            ],
            "right": "A",
            "rightIdx": 1,
            "id": 10
        },
        {
            "question": "当口香糖和薯片同时食用，会发生哪种情况？",
            "answer": [
                "A薯片被口香糖粘住，无法彻底咀嚼、吞咽",
                "B口香糖变硬，不能继续咀嚼 ",
                "C薯片融化",
                "D口香糖融化"
            ],
            "right": "D",
            "rightIdx": 4,
            "id": 11
        },
        {
            "question": "清除衣服上的油墨污渍，正确的做法是？",
            "answer": [
                "A.淡盐水+白胡萝卜汁",
                "B.米饭加盐搓洗",
                "C.白醋+肥皂水洗",
                "D.酒精+肥皂水洗"
            ],
            "right": "D",
            "rightIdx": 4,
            "id": 12
        },
        {
            "question": "将木板放在以下哪种液体表面，在木板上钉钉子会更容易？ ",
            "answer": [
                "A玉米淀粉糊 ",
                "B番茄酱",
                "C蜂蜜"
            ],
            "right": "A",
            "rightIdx": 1,
            "id": 13
        },
        {
            "question": "将打火机内的液体倒入半瓶可乐中，然后将可乐瓶倒置，会发生以下哪种现象？",
            "answer": [
                "A可乐瓶向上飞出",
                "B 可乐瓶逐渐收缩后燃烧",
                "C可乐瓶瞬间爆炸"
            ],
            "right": "A",
            "rightIdx": 1,
            "id": 14
        },
        {
            "question": "50克的以下哪种物体在两米的高度下自由落体，可以砸破钢化玻璃？",
            "answer": [
                "A. 瓷块",
                "B. 铁块",
                "C. 冰块"
            ],
            "right": "A",
            "rightIdx": 1,
            "id": 15
        },
        /*　　{
        　　　　"question":"以下哪种情况，人站在一盒鸡蛋上，鸡蛋不会碎？ ",
        　　　　"answer":[
        　　　　　　"A 在鸡蛋上放一块硬纸壳 一只脚穿鞋踩上去 另一只脚悬空",
        　　　　　　"B 在鸡蛋上放一块玻璃板 两只脚光脚同时踩上去 ",
        　　　　　　"C 鸡蛋上什么也不放 穿运动鞋两只脚先后踩上去"
        　　　　],
        　　　　"right":"A",
        　　　　"rightIdx":1,
        　　　　"id":16
        　　},*/
        {
            "question": "以下哪种方法往杯子里倒盒装果汁不会产生飞溅？",
            "answer": [
                "A 倒果汁过程中，出口在上",
                "B 倾倒时晃动瓶身，出口在下 ",
                "C 倒果汁过程中，用力挤压瓶身，出口在下"
            ],
            "right": "A",
            "rightIdx": 1,
            "id": 17
        },
        {
            "question": "用502胶水粘物品，在哪种情况下会凝固得又快又结实？",
            "answer": [
                "A放干燥箱中",
                "B放水中",
                "C 放暖风旁边吹"
            ],
            "right": "C",
            "rightIdx": 3,
            "id": 18
        },
        {
            "question": "把一只玩具小狗放在装满沙子的箱子中间，从箱子底下向上吹气，会发生以下哪种现象？",
            "answer": [
                "A. 小狗会在沙子中间游动",
                "B. 小狗会漂浮在沙子表面",
                "C. 小狗会在箱子底部飞速转圈"
            ],
            "right": "B",
            "rightIdx": 2,
            "id": 19
        },
        {
            "question": "借助以下哪种物品可以在相同时间内，剥出数量更多的完整的蒜？",
            "answer": [
                "A两个不锈钢盆",
                "B一盆盐水",
                "C 一把切菜刀"
            ],
            "right": "A",
            "rightIdx": 1,
            "id": 20
        },
        {
            "question": "吃辣椒之前，将辣椒泡在下列哪种饮品中可以更有效降低辣椒的辣度？",
            "answer": [
                "A味动力",
                "B橙汁",
                "C牛奶",
                "D白酒"
            ],
            "right": "D",
            "rightIdx": 4,
            "id": 21
        },
        {
            "question": "用以下哪种方法烹饪胡萝卜，最有营养？ ",
            "answer": [
                "A汽蒸",
                "B先炒2分钟，再加水煮"
            ],
            "right": "A",
            "rightIdx": 1,
            "id": 22
        },
        {
            "question": "野外烧烤时，往身上喷哪种液体容易导致引火烧身？",
            "answer": [
                "A防晒喷雾 ",
                "B 保湿喷雾"
            ],
            "right": "A",
            "rightIdx": 1,
            "id": 23
        },
        {
            "question": "以下哪种乐器在水下不能发出声音？",
            "answer": [
                "A小提琴",
                "B长笛"
            ],
            "right": "B",
            "rightIdx": 2,
            "id": 24
        },
        {
            "question": "以下哪种粉末最容易引发爆炸？",
            "answer": [
                "A酵母粉",
                "B玉米粉"
            ],
            "right": "B",
            "rightIdx": 2,
            "id": 25
        },
        {
            "question": "以下哪种方法能快速剥出完整的葡萄？",
            "answer": [
                "A放在盐水浸泡20分钟后 ",
                "B放冰箱冷冻一小时后"
            ],
            "right": "B",
            "rightIdx": 2,
            "id": 26
        },
        {
            "question": "加入以下哪种物质的冰最结实？",
            "answer": [
                "A沙子 ",
                "B棉花"
            ],
            "right": "B",
            "rightIdx": 2,
            "id": 27
        },
        {
            "question": "如何打开摇晃过的可乐不让水喷溅出来？ ",
            "answer": [
                "A放到水里浸泡一下再打开 ",
                "B弹弹罐子四周再打开"
            ],
            "right": "B",
            "rightIdx": 2,
            "id": 28
        },
        {
            "question": "把一个纸风车插到一支笔芯上面，在不接触风车的情况下，在风车下面摆上蜡烛，会发生以下哪种现象？",
            "answer": [
                "A 风车旋转起来 ",
                "B 笔芯将风车引燃"
            ],
            "right": "A",
            "rightIdx": 1,
            "id": 29
        },
        {
            "question": "生鸡蛋怎样放置保存更加新鲜？",
            "answer": [
                "A 大头朝上 ",
                "B 大头朝下"
            ],
            "right": "A",
            "rightIdx": 1,
            "id": 30
        },
        {
            "question": "一滴雨滴的质量是蚊子的50倍，那为什么下雨天，蚊子是如何保护自己的？ ",
            "answer": [
                "A:蚊子会被雨水砸到，但是很快可逃生 ",
                "B蚊子可感应雨水 所以不会被砸到"
            ],
            "right": "A",
            "rightIdx": 1,
            "id": 31
        },
        {
            "question": "以下哪种物质可以敲断两厘米厚度的木板？",
            "answer": [
                "A:报纸卷",
                "B:橡胶管"
            ],
            "right": "A",
            "rightIdx": 1,
            "id": 32
        },
        {
            "question": "煤火不旺时，撒入以下哪种东西可以助长火势？",
            "answer": [
                "A:盐 ",
                "B:胡椒"
            ],
            "right": "A",
            "rightIdx": 1,
            "id": 33
        },
        {
            "question": "在燃气灶上烧开水时，为了节省原料，应该怎样做？",
            "answer": [
                "A:先用中火，后用大火 ",
                "B:先用大火，后用中火"
            ],
            "right": "A",
            "rightIdx": 1,
            "id": 34
        },
        {
            "question": "如何打开摇晃过的可乐不让水喷溅出来？ ",
            "answer": [
                "A 缓慢颠倒两下再打开",
                "B 放到水里浸泡一下再打开",
                "C 弹弹罐子四周再打开",
                "D 在桌子上滚动三圈再打开"
            ],
            "right": "C",
            "rightIdx": 3,
            "id": 35
        },
        {
            "question": "把多个葡萄干放进装有雪碧的玻璃杯中，会发生怎样的现象？ ",
            "answer": [
                "A 葡萄干上下浮动",
                "B 葡萄干沉在杯底 ",
                "C 部分雪碧飞溅出杯外 "
            ],
            "right": "A",
            "rightIdx": 1,
            "id": 36
        },
        {
            "question": "借助以下哪种物品冻一斤肉馅，放在冷水解冻的时候用时最短？",
            "answer": [
                "A 保鲜袋",
                "B 保鲜盒 ",
                "C 薄铁盆 "
            ],
            "right": "A",
            "rightIdx": 1,
            "id": 37
        },
        {
            "question": "手里拿着以下哪种物品，可以让漂浮在水面的甜甜圈跟着手运动的方向移动？",
            "answer": [
                "A 磁铁",
                "B 蜡烛 ",
                "C 面团 "
            ],
            "right": "A",
            "rightIdx": 1,
            "id": 38
        },
        {
            "question": "在不借助外力的情况下，1根棉线加最少几根火柴，可将10瓶味动力吊在桌边？",
            "answer": [
                "A 1根",
                "B 3根 ",
                "C 5根 "
            ],
            "right": "B",
            "rightIdx": 2,
            "id": 39
        },
        {
            "question": "把冰冻大虾倒入沸腾的油锅中，会出现什么现象？",
            "answer": [
                "A 大虾飞出",
                "B 油锅燃烧起来 ",
                "C 油锅爆炸 "
            ],
            "right": "B",
            "rightIdx": 2,
            "id": 40
        },
        {
            "question": "一滴雨滴的质量是蚊子的50倍，那为什么下雨天，蚊子是如何保护自己的？ ",
            "answer": [
                "A:蚊子会被雨水砸到，但是很快可逃生 ",
                "B蚊子可感应雨水 所以不会被砸到"
            ],
            "right": "A",
            "rightIdx": 1,
            "id": 41
        },
        {
            "question": "红蓝绿色的光叠加和红蓝绿色的玻璃片叠加，分别出现以下哪种颜色？",
            "answer": [
                "A 黑色 白色 ",
                "B白色 白色",
                "C 白色 黑色"
            ],
            "right": "C",
            "rightIdx": 3,
            "id": 42
        },
        {
            "question": "把一个纸风车插到一支笔芯上面，在不接触风车的情况下，在风车下面摆上蜡烛，会发生以下哪种现象？",
            "answer": [
                "A 风车旋转起来 ",
                "B 风车带动笔芯一起向上漂浮",
                "C 笔芯将风车引燃"
            ],
            "right": "A",
            "rightIdx": 1,
            "id": 43
        },
/*        {
            "question": "将一块新鲜的鸭血放在泡沫板上，然后将泡沫板放在水面，手里拿着一块磁铁靠近鸭血，则会出现以下哪种现象？",
            "answer": [
                "A 泡沫板远离磁铁",
                "B 泡沫板靠近磁铁",
                "C 泡沫板逐渐下沉"
            ],
            "right": "A",
            "rightIdx": 1,
            "id": 44
        },*/
        {
            "question": "把多个葡萄干放进装有碳酸饮料的玻璃杯中，会发生怎样的现象？",
            "answer": [
                "A 葡萄干上下浮动 ",
                "B 葡萄干一直漂浮在表面",
                "C 碳酸饮料起沫喷出"
            ],
            "right": "A",
            "rightIdx": 1,
            "id": 45
        },
        {
            "question": "以下哪种方法能让一块奶油蛋糕迅速膨胀变大？",
            "answer": [
                "A将蛋糕放在真空环境下",
                "B将蛋糕放在微波炉里加热",
                "C将蛋糕切开多个缝隙后在缝隙中倒入少量白酒"
            ],
            "right": "A",
            "rightIdx": 1,
            "id": 46
        },
        {
            "question": "脚踩在浸过海水的沙滩上，沙子表面会出现以下哪种情况？",
            "answer": [
                "A 沙子表面的水会消失不见 ",
                "B沙子里会冒出很多微小的气泡儿",
                "C沙子里的水渗出"
            ],
            "right": "A",
            "rightIdx": 1,
            "id": 47
        },
        {
            "question": "以下哪种物品能够快速将一个生土豆扎孔穿透？",
            "answer": [
                "A 一块口香糖 ",
                "B 一根吸管",
                "C一根细铁丝"
            ],
            "right": "B",
            "rightIdx": 2,
            "id": 48
        },
        {
            "question": "以下哪个选项不能够开启啤酒瓶盖？",
            "answer": [
                "A 纸巾 ",
                "B 厚泡沫板 ",
                "C 猴皮筋儿 ",
                "D 头发 "
            ],
            "right": "B",
            "rightIdx": 2,
            "id": 49
        },
        {
            "question": "以下哪种物质可以将融化的蜡烛引燃？",
            "answer": [
                "A:气球",
                "B:纸巾",
                "C:水",
                "D:电吹风"
            ],
            "right": "C",
            "rightIdx": 3,
            "id": 50
        },
        {
            "question": "插在生日蛋糕上的蜡烛点燃后会出现蜡油流下弄脏蛋糕，以下哪种方法可以使蜡烛不流蜡油？",
            "answer": [
                "A:用锡纸包裹烛芯 ",
                "B:在烛芯周围放上盐",
                "C:选用长且粗，材质为棉线的烛芯"
            ],
            "right": "B",
            "rightIdx": 2,
            "id": 51
        },
        {
            "question": "装满水的杯子放入以下哪种物质不会溢出？",
            "answer": [
                "A：10枚一元硬币 ",
                "B:两个铜块",
                "C: 一枚鸡蛋",
                "D:100枚图钉"
            ],
            "right": "D",
            "rightIdx": 4,
            "id": 52
        },
        {
            "question": "旋风暴最先会把屋顶的哪一面先起来呢？",
            "answer": [
                "A:跟风接触的那一面",
                "B:背离风向的那一面",
                "C:两面的机会均等"
            ],
            "right": "B",
            "rightIdx": 2,
            "id": 53
        },
        {
            "question": "在报纸上煎鸡蛋会发生什么?",
            "answer": [
                "A:爆炸起火",
                "B:鸡蛋煎熟",
                "C:报纸烧漏",
                "D:鸡蛋煎糊"
            ],
            "right": "B",
            "rightIdx": 2,
            "id": 54
        },
        {
            "question": "用报纸锅可制作以下哪种食物？",
            "answer": [
                "A 三明治",
                "B 拉面",
                "C 牛排",
                "D 饺子"
            ],
            "right": "A",
            "rightIdx": 1,
            "id": 55
        },
        {
            "question": "以下哪种方法可以使生鸡蛋从高处摔下也不会碎？",
            "answer": [
                "A:用纸包裹 ",
                "B:用保鲜膜包裹",
                "C:放铁盒里"
            ],
            "right": "A",
            "rightIdx": 1,
            "id": 56
        },
        /*　　{
        　　　　"question":"如何辨别新鲜鸡蛋和陈质鸡蛋？",
        　　　　"answer":[
        　　　　　　"A.放在盛满水的盆里，沉下去的新鲜鸡蛋，浮起来的是陈鸡蛋",
        　　　　　　"B.放在手里，手感光滑，有轻飘感觉的是新鲜鸡蛋；手感粗糙，有重量感的是陈鸡蛋",
        　　　　　　"C.观察表面，发亮的是新鲜鸡蛋，表皮有小颗粒凸起，略微发白似有一层白霜的是陈鸡蛋"
        　　　　],
        　　　　"right":"A",
        　　　　"rightIdx":1,
        　　　　"id":57
        　　},*/
        {
            "question": "以下哪种方法可以快速并且完整的给葡萄剥皮？",
            "answer": [
                "A:用醋泡过",
                "B:冷冻过",
                "C:用热水冲洗"
            ],
            "right": "B",
            "rightIdx": 2,
            "id": 58
        },
        {
            "question": "以下哪种食物可以最快打开椰子？",
            "answer": [
                "A:橡皮筋 ",
                "B:口香糖",
                "C:榴莲 "
            ],
            "right": "B",
            "rightIdx": 2,
            "id": 59
        },
        {
            "question": "以下哪种工具可以在最短时间内击碎钢化玻璃？",
            "answer": [
                "A:扳手",
                "B:锤子",
                "C:钥匙"
            ],
            "right": "C",
            "rightIdx": 3,
            "id": 60
        },
        {
            "question": "从大到小排列的多米诺和从小到大排列的多米诺，哪个推到速度更快？",
            "answer": [
                "A:从大到小",
                "B:从小到大",
                "C:相同"
            ],
            "right": "A",
            "rightIdx": 1,
            "id": 61
        },
        {
            "question": "音响与什么共同作用会出现水倒流的现象？",
            "answer": [
                "A:频闪灯 ",
                "B:电风扇",
                "C:干冰机"
            ],
            "right": "A",
            "rightIdx": 1,
            "id": 62
        },
        {
            "question": "关于饮用碳酸饮料，以下哪种说法是错误的？",
            "answer": [
                "A. 有消热祛暑的作用",
                "B. 有助于提高食欲",
                "C. 会产生心慌、乏力、尿频等不适感"
            ],
            "right": "B",
            "rightIdx": 2,
            "id": 63
        },
        /*　　{
        　　　　"question":"水果是很多人都喜欢的，那么对水果的了解真正有多少呢？下面关于水果的选项哪个是正确的?",
        　　　　"answer":[
        　　　　　　"A．水果可以代替蔬菜来满足人们日常的营养需求 ",
        　　　　　　"B．削去果皮不能解决农药问题 ",
        　　　　　　"C．水果富含的维生素特别多",
        　　　　　　"D．多吃水果可以减肥"
        　　　　],
        　　　　"right":"B",
        　　　　"rightIdx":2,
        　　　　"id":64
        　　},*/
        {
            "question": "手指粘上502胶水，借助以下哪种生活用品可以把502胶水清除？",
            "answer": [
                "A:风油精 ",
                "B:洗甲水",
                "C:食用醋",
                "D:润肤油"
            ],
            "right": "B",
            "rightIdx": 2,
            "id": 65
        },
        {
            "question": "把多个葡萄干放进装有雪碧的玻璃杯中，会发生怎样的现象？ ",
            "answer": [
                "A:葡萄干上下浮动",
                "B:葡萄干沉在杯底 ",
                "C:部分雪碧飞溅出杯外",
                "D:部分葡萄干飞出杯外"
            ],
            "right": "A",
            "rightIdx": 1,
            "id": 66
        },
        {
            "question": "以下哪种饮品解辣最有效？",
            "answer": [
                "A:白水",
                "B:可乐",
                "C:啤酒",
                "D:牛奶"
            ],
            "right": "D",
            "rightIdx": 4,
            "id": 67
        },
        {
            "question": "吃了一半的苹果放在空气中很容易变色，以下哪种方法能够最有效地防止其变色？",
            "answer": [
                "A:放入水中浸泡 ",
                "B:保鲜膜包裹",
                "C:柠檬汁涂抹"
            ],
            "right": "C",
            "rightIdx": 3,
            "id": 68
        },
        {
            "question": "踩到以下哪种食品最容易摔跤？",
            "answer": [
                "A:黄豆 ",
                "B:香蕉皮",
                "C:油"
            ],
            "right": "C",
            "rightIdx": 3,
            "id": 69
        },
        {
            "question": "醋放久了会生白，为了防止其生白，最好在醋内加一些黄酒后再掺入少许",
            "answer": [
                "A:姜末 ",
                "B:白糖",
                "C:精盐",
                "D:味精"
            ],
            "right": "C",
            "rightIdx": 3,
            "id": 70
        },
        {
            "question": "脚踩在沙滩上 沙子表面的水会出现以下哪种情况？",
            "answer": [
                "A 水会消失不见 ",
                "B会冒出很多微小的气泡儿",
                "C水会分散在脚的周围"
            ],
            "right": "A",
            "rightIdx": 1,
            "id": 71
        }
    ],
    result:[{
        "min":0,
        "max":2,
        "name":"黄国伦",
        "title":"",
        "text":"很抱歉地通知你，你的“科学商”不在线，需要努力提高哦！",
        "photo":"hgl.png"
    },{
        "min":2,
        "max":4,
        "name":"刘维",
        "title":"经验主义型",
        "text":"你拥有的是“经验主义型科学商”\n是反应灵敏和自发主动的一种人，喜欢凭感觉做事，缺乏一定的科学理论知识，往往猜中了开头，猜不中结果。不过别灰心，通过后天的努力可以提高自己的“科学商”。",
        "photo":"lw.png"
    },{
        "min":4,
        "max":6,
        "name":"喻恩泰",
        "title":"知识储备型",
        "text":"上知天文下知地理，拥有一定的科学知识储备和科学审美，但是别忘了实践是检验真理的唯一标准，从生活的实践中发掘科学的情趣，也能提高“科学商”哦！",
        "photo":"yet.png"
    },{
        "min":6,
        "max":8,
        "name":"高晓攀",
        "title":"生活探索型",
        "text":"好奇心强，喜欢独立思考，有科学探索的热情，擅长从生活经验里面寻找科学答案，拥有较强的人格魅力，相信你是一个有故事的人。",
        "photo":"gxp.png"
    },{
        "min":8,
        "max":10,
        "name":"韩雪",
        "title":"科学达人型",
        "text":"恭喜你，你就是传说中的高手在民间！未来的诺贝尔奖离你不远了！",
        "photo":"hx.png"
    }]
};